# 演示 while循环
"""
while 判断条件:
    # 当条件满足 需要执行的内容

说明:
    while: 实现循环操作的关键字
    条件判断: 是否进入循环的依据
        当条件成立, 就执行循环里面的内容, 条件一直成立 就一直循环执行内部的代码 直到条件不成立
"""

# 需求: 请循环 打印 5次  Python真有趣
# 1- 定义计数器
num = 1

# 2- 编写循环操作
while num <= 5:
    # 2.1 执行循环的主体代码
    print("Python真有趣")

    # 2.2 更新计数器 +1
    # num = num + 1
    num += 1


# 需求: 求 1~50的和
# 思路: 1- 需要对 1~50进行遍历(循环)  2- 每循环一个 就要对其进行累加计算(在while循环外部定义一个初试累加变量)

# 如何进行 1 ~ 50 循环呢
# 第一步: 定义计数器
i = 1

# 第二步: 编写循环操作
# 2.1 定义一个累加求和的变量
sum_total = 0

while i <= 50:
    # 2.2 循环的代码块
    sum_total = sum_total + i
    # 第三步: 更新计数器
    i += 1

print(sum_total)


# 需求2: 求1~50之间，所有奇数的和  不能被2 整除的 就是奇数(余数不为0)
# 思路: 1- 需要对 1~50进行遍历(循环)  2- 每循环一个 先判断是否为奇数, 如果是对其进行累加计算(在while循环外部定义一个初试累加变量)

# 1- 定义计数器
i = 1

# 2- 编写循环操作
# 2.2.1 先定义一个累加的初始变量
sum_odd = 0
while i <= 50:
    # 循环的主体要执行的代码块
    # 2.1 判断是否为奇数
    if i % 2 != 0:
        # 2.2 如果是奇数, 进行累加
        # 2.2.2 执行累加
        sum_odd += i

    # 3- 更新计数器
    i += 1

print(sum_odd)