# 演示 break:  实现中断循环 直接退出循环操作
# 需求: 遍历从  1 ~ 50 , 要求 一旦值能够被15整除(除 15  余数为 0) 立即退出循环
# 1- 定义计数器
i = 1

# 2- 编写循环
while i <= 50:
    # 循环的主体内容
    # 如果值能够被15整除, 退出循环
    if i % 15 == 0:
        break

    print(i)

    # 3- 更新计数器
    i += 1

# 退出循环后, 执行后续的代码
print("循环已终止，退出程序")


# 演示 continue:  跳过本次循环, 进入下一次循环

# 需求: 遍历从  1 ~ 50 , 要求 如果遍历的值能够被 6 整除  将该值直接跳过不打印
# 1- 定义计数器
i = 1

# 2- 编写循环
while i <= 50:
    # 循环的主体内容
    # 如果能够被6整除, 将该值跳过 不打印
    if i % 6 == 0:
        # 更新计数器: 必须在continue前更新，否则会出现死循环
        i += 1
        continue

    print(i)

    # 3- 更新计数器
    i += 1

# 退出循环后, 执行后续的代码
print("循环执行完毕")